Информационная_база/src/Documents/ЛБТ_ПроектВнедрения/ЛБТ_ПроектВнедрения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЛБТ_ПроектВнедрения</name>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.ЛБТ_НаправлениеДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ЛБТ_Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ЛБТ_ШаблоныТиповЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>МасштабВнедрения</name>
    <type>
      <types>CatalogRef.ЛБТ_МасштабВнедрения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьЧасаРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезервВремени</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>РаботыПоПроекту</name>
    <attributes>
      <name>ТипЗадачи</name>
      <type>
        <types>CatalogRef.ЛБТ_ТипыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗадачаАвтоматизации</name>
      <type>
        <types>CatalogRef.ЛБТ_ЗадачиАвтоматизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Нормочасы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФункциональныйБлок</name>
      <type>
        <types>CatalogRef.ЛБТ_ФункциональныеБлоки</types>
      </type>
    </attributes>
    <attributes>
      <name>Типовой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбязательноНа1Этапе</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсключенныеВидыРабот</name>
    <attributes>
      <name>ВидРабот</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Информационная_база/src/Documents/ЛБТ_ПроектВнедрения/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура ПреобразоватьТЗВДеревоЗначений()
	
	ФункциональныеБлоки = Новый ТаблицаЗначений;
	ФункциональныеБлоки.Колонки.Добавить("ФункциональныйБлок",Новый ОписаниеТипов("СправочникСсылка.ЛБТ_ФункциональныеБлоки"));
	ФункциональныеБлоки.Колонки.Добавить("ОбъемРабот",Новый ОписаниеТипов("Число"));
	ФункциональныеБлоки.Колонки.Добавить("Нормочасы",Новый ОписаниеТипов("Число"));
	
	Для каждого стр из Объект.РаботыПоПроекту Цикл
		стрН = ФункциональныеБлоки.Добавить();
		стрН.ФункциональныйБлок = стр.ФункциональныйБлок;
		стрН.ОбъемРабот = стр.ОбъемРабот;
		стрН.Нормочасы = стр.Нормочасы;
	КонецЦикла;
	
	ФункциональныеБлоки.Свернуть("ФункциональныйБлок","ОбъемРабот,Нормочасы");
	
	СоставРаботДЗ = РеквизитФормыВЗначение("ДеревоЗначенийРаботыПоПроекту");
	
	Для каждого стрФункциональныеБлоки из ФункциональныеБлоки Цикл
		
		СтрокаВерхнегоУровня = СоставРаботДЗ.Строки.Добавить();
		СтрокаВерхнегоУровня.НазваниеЗадачиАвтоматизации = стрФункциональныеБлоки.ФункциональныйБлок;
		СтрокаВерхнегоУровня.Нормочасы = стрФункциональныеБлоки.Нормочасы;
		СтрокаВерхнегоУровня.ОбъемРабот = стрФункциональныеБлоки.ОбъемРабот;
		
		МассивНайденныхСтрок = Объект.РаботыПоПроекту.НайтиСтроки(Новый Структура("ФункциональныйБлок",стрФункциональныеБлоки.ФункциональныйБлок));
		
		ОбязательноУВсехПодчиненных = ложь;
		
		Для каждого стрНайденныеСтроки из МассивНайденныхСтрок Цикл
			
			СтрокаНижнегоУровня = СтрокаВерхнегоУровня.Строки.Добавить();
			СтрокаНижнегоУровня.НазваниеЗадачиАвтоматизации = стрНайденныеСтроки.ЗадачаАвтоматизации;
			СтрокаНижнегоУровня.Нормочасы = стрНайденныеСтроки.Нормочасы;
			СтрокаНижнегоУровня.ОбъемРабот = стрНайденныеСтроки.ОбъемРабот;
			СтрокаНижнегоУровня.ОбязательноНа1Этапе = стрНайденныеСтроки.ОбязательноНа1Этапе;
			
			Если СтрокаНижнегоУровня.ОбязательноНа1Этапе и не ОбязательноУВсехПодчиненных Тогда
				ОбязательноУВсехПодчиненных = истина;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОбязательноУВсехПодчиненных Тогда
			СтрокаВерхнегоУровня.ОбязательноНа1Этапе = истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(СоставРаботДЗ,"ДеревоЗначенийРаботыПоПроекту");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПреобразоватьТЗВДеревоЗначений();
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьДокумент(Команда)
	ОткрытьФорму("Обработка.ЛБТ_АРМ.Форма.Форма",Новый Структура("СсылкаНаДокумент",Объект.Ссылка));
КонецПроцедуры
